app/services/create_product.rb

  def call
    Product.create(@params)
---
INSERT INTO "products" ("name", "description", "vendor", "price", "currency", "stock", "image_url", "sku", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)