app/services/update_product.rb

UPDATE "products" SET "name" = ?, "description" = ?, "vendor" = ?, "price" = ?, "stock" = ?, "image_url" = ?, "sku" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
  def call
    @product.update(@params)