app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # rendering json and xml
    product  = Product.find_by(id: params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def update
    # call service to update product
    product = UpdateProduct.call(Product.find(params[:id]), product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Product.find(params[:id]).destroy